import group from './group.svg'
import minded from './minded.svg'
import neuron from './neuron.svg'
import programm from './programm.svg'
import teacher from './teacher.svg'

export const resultData = [
  {
    id: 1,
    icon: group,
    subtitle: 'Маленькую группу (6-12 человек)',
    text: 'Где преподаватель может уделить внимание каждому. Если студент на чём-то застревает — с ним занимаются отдельно. Если знает больше остальных — ему дают продвинутые задания',
  },
  {
    id: 2,
    icon: teacher,
    subtitle: 'Преподавателя',
    text: 'Который реально заботится о том, что ты освоишь программу. Наши наставники часто созваниваются со студентами по вечерам или выходным, хотя это не входит в их обязанности',
  },
  {
    id: 3,
    icon: neuron,
    subtitle: 'Связи',
    text: 'Сокурсники, наставники и приглашённые эксперты станут частью твоих деловых знакомств, которые помогут найти работу',
  },
  {
    id: 4,
    icon: minded,
    subtitle: 'Единомышленников',
    text: 'Потому что легче достигать целей в группе',
  },
  {
    id: 5,
    icon: programm,
    subtitle: 'Программу',
    text: 'На основе десятилетнего опыта ведущих буткемпов мира',
  },
]
