import varyaPhoto from './stud-1.png'

export const studentData = [
  {
    id: 1,
    studentPhoto: varyaPhoto,
    studentAge: '32 года',
    studentName: 'Варя Рубцова',
    studentGender: 'female',
    studentResult: 'T-Systems',
    QA: [
      {
        question: 'Чем занималась до и что подтолкнуло перейти в программирование?',
        answer: 'Всю жизнь я проработала менеджером в администрации крупной иностранной компании, которая известна своими автомобилями. В программирование я решила пойти, потому что мне стало дико скучно на административной работе, и дальнейших перспектив я уже не видела, так как достигла потолка в этой компании. А вот в программировании я увидела надежду на что-то более интересное: классные проекты и можно легко уехать жить в другую страну, когда вздумается!',
      },
      {
        question: 'Какой был опыт в программировании?',
        answer: 'Ноль целых и ноль десятых.',
      },
      {
        question: 'Почему выбрала интенсивный формат обучения (по 10 часов в день)?',
        answer: 'Такой формат мне кажется более жизнеспособным: ты полностью погружаешься в новый мир, новые знания, мотивация зашкаливает — ты хочешь всё знать! А как только получил новые знания — сразу воплощать в жизнь идеи для дальнейшего продвижения. При всём желании не успеешь забыть, что делал месяц назад, потому что уже пишешь код!',
      },
      {
        question: 'Как оцениваешь нашу школу?',
        answer: 'Saint Code — отличная школа, великолепные наставники, которые заинтересованы в твоём успехе и понимании материала, всегда готовы прийти на выручку!',
      },
      {
        question: 'Что было самым сложным на протяжении курса?',
        answer: 'Остановиться и лечь спать! Потому что хотелось ещё и ещё сделать, там чуть исправить, почитать теорию, как тут поспишь?',
      },
      {
        question: 'Какие советы можешь дать будущим студентам?',
        answer: 'Не жалей себя и не говори себе, что ты тупой) А вообще, в буткемпе надо осознавать, что ты пришёл учиться ради светлого будущего, и на 3 месяца погрузиться в абсолютно новый мир.',
      },
    ],
  },
  {
    id: 2,
    studentPhoto: varyaPhoto,
    studentAge: '32 года',
    studentName: 'Варя Рубцова',
    studentGender: 'male',
    studentResult: 'T-Systems',
    QA: [
      {
        question: 'Чем занималась до и что подтолкнуло перейти в программирование?',
        answer: 'Всю жизнь я проработала менеджером в администрации крупной иностранной компании, которая известна своими автомобилями. В программирование я решила пойти, потому что мне стало дико скучно на административной работе, и дальнейших перспектив я уже не видела, так как достигла потолка в этой компании. А вот в программировании я увидела надежду на что-то более интересное: классные проекты и можно легко уехать жить в другую страну, когда вздумается!',
      },
      {
        question: 'Какой был опыт в программировании?',
        answer: 'Ноль целых и ноль десятых.',
      },
      {
        question: 'Почему выбрала интенсивный формат обучения (по 10 часов в день)?',
        answer: 'Такой формат мне кажется более жизнеспособным: ты полностью погружаешься в новый мир, новые знания, мотивация зашкаливает — ты хочешь всё знать! А как только получил новые знания — сразу воплощать в жизнь идеи для дальнейшего продвижения. При всём желании не успеешь забыть, что делал месяц назад, потому что уже пишешь код!',
      },
      {
        question: 'Как оцениваешь нашу школу?',
        answer: 'Saint Code — отличная школа, великолепные наставники, которые заинтересованы в твоём успехе и понимании материала, всегда готовы прийти на выручку!',
      },
      {
        question: 'Что было самым сложным на протяжении курса?',
        answer: 'Остановиться и лечь спать! Потому что хотелось ещё и ещё сделать, там чуть исправить, почитать теорию, как тут поспишь?',
      },
      {
        question: 'Какие советы можешь дать будущим студентам?',
        answer: 'Не жалей себя и не говори себе, что ты тупой) А вообще, в буткемпе надо осознавать, что ты пришёл учиться ради светлого будущего, и на 3 месяца погрузиться в абсолютно новый мир.',
      },
    ],
  },
  {
    id: 3,
    studentPhoto: varyaPhoto,
    studentAge: '32 года',
    studentName: 'Варя Рубцова',
    studentGender: 'female',
    studentResult: 'T-Systems',
    QA: [
      {
        question: 'Чем занималась до и что подтолкнуло перейти в программирование?',
        answer: 'Всю жизнь я проработала менеджером в администрации крупной иностранной компании, которая известна своими автомобилями. В программирование я решила пойти, потому что мне стало дико скучно на административной работе, и дальнейших перспектив я уже не видела, так как достигла потолка в этой компании. А вот в программировании я увидела надежду на что-то более интересное: классные проекты и можно легко уехать жить в другую страну, когда вздумается!',
      },
      {
        question: 'Какой был опыт в программировании?',
        answer: 'Ноль целых и ноль десятых.',
      },
      {
        question: 'Почему выбрала интенсивный формат обучения (по 10 часов в день)?',
        answer: 'Такой формат мне кажется более жизнеспособным: ты полностью погружаешься в новый мир, новые знания, мотивация зашкаливает — ты хочешь всё знать! А как только получил новые знания — сразу воплощать в жизнь идеи для дальнейшего продвижения. При всём желании не успеешь забыть, что делал месяц назад, потому что уже пишешь код!',
      },
      {
        question: 'Как оцениваешь нашу школу?',
        answer: 'Saint Code — отличная школа, великолепные наставники, которые заинтересованы в твоём успехе и понимании материала, всегда готовы прийти на выручку!',
      },
      {
        question: 'Что было самым сложным на протяжении курса?',
        answer: 'Остановиться и лечь спать! Потому что хотелось ещё и ещё сделать, там чуть исправить, почитать теорию, как тут поспишь?',
      },
      {
        question: 'Какие советы можешь дать будущим студентам?',
        answer: 'Не жалей себя и не говори себе, что ты тупой) А вообще, в буткемпе надо осознавать, что ты пришёл учиться ради светлого будущего, и на 3 месяца погрузиться в абсолютно новый мир.',
      },
    ],
  },
  {
    id: 4,
    studentPhoto: varyaPhoto,
    studentAge: '32 года',
    studentName: 'Варя Рубцова',
    studentGender: 'male',
    studentResult: 'T-Systems',
    QA: [
      {
        question: 'Чем занималась до и что подтолкнуло перейти в программирование?',
        answer: 'Всю жизнь я проработала менеджером в администрации крупной иностранной компании, которая известна своими автомобилями. В программирование я решила пойти, потому что мне стало дико скучно на административной работе, и дальнейших перспектив я уже не видела, так как достигла потолка в этой компании. А вот в программировании я увидела надежду на что-то более интересное: классные проекты и можно легко уехать жить в другую страну, когда вздумается!',
      },
      {
        question: 'Какой был опыт в программировании?',
        answer: 'Ноль целых и ноль десятых.',
      },
      {
        question: 'Почему выбрала интенсивный формат обучения (по 10 часов в день)?',
        answer: 'Такой формат мне кажется более жизнеспособным: ты полностью погружаешься в новый мир, новые знания, мотивация зашкаливает — ты хочешь всё знать! А как только получил новые знания — сразу воплощать в жизнь идеи для дальнейшего продвижения. При всём желании не успеешь забыть, что делал месяц назад, потому что уже пишешь код!',
      },
      {
        question: 'Как оцениваешь нашу школу?',
        answer: 'Saint Code — отличная школа, великолепные наставники, которые заинтересованы в твоём успехе и понимании материала, всегда готовы прийти на выручку!',
      },
      {
        question: 'Что было самым сложным на протяжении курса?',
        answer: 'Остановиться и лечь спать! Потому что хотелось ещё и ещё сделать, там чуть исправить, почитать теорию, как тут поспишь?',
      },
      {
        question: 'Какие советы можешь дать будущим студентам?',
        answer: 'Не жалей себя и не говори себе, что ты тупой) А вообще, в буткемпе надо осознавать, что ты пришёл учиться ради светлого будущего, и на 3 месяца погрузиться в абсолютно новый мир.',
      },
    ],
  },
  {
    id: 5,
    studentPhoto: varyaPhoto,
    studentAge: '32 года',
    studentName: 'Варя Рубцова',
    studentGender: 'male',
    studentResult: 'T-Systems',
    QA: [
      {
        question: 'Чем занималась до и что подтолкнуло перейти в программирование?',
        answer: 'Всю жизнь я проработала менеджером в администрации крупной иностранной компании, которая известна своими автомобилями. В программирование я решила пойти, потому что мне стало дико скучно на административной работе, и дальнейших перспектив я уже не видела, так как достигла потолка в этой компании. А вот в программировании я увидела надежду на что-то более интересное: классные проекты и можно легко уехать жить в другую страну, когда вздумается!',
      },
      {
        question: 'Какой был опыт в программировании?',
        answer: 'Ноль целых и ноль десятых.',
      },
      {
        question: 'Почему выбрала интенсивный формат обучения (по 10 часов в день)?',
        answer: 'Такой формат мне кажется более жизнеспособным: ты полностью погружаешься в новый мир, новые знания, мотивация зашкаливает — ты хочешь всё знать! А как только получил новые знания — сразу воплощать в жизнь идеи для дальнейшего продвижения. При всём желании не успеешь забыть, что делал месяц назад, потому что уже пишешь код!',
      },
      {
        question: 'Как оцениваешь нашу школу?',
        answer: 'Saint Code — отличная школа, великолепные наставники, которые заинтересованы в твоём успехе и понимании материала, всегда готовы прийти на выручку!',
      },
      {
        question: 'Что было самым сложным на протяжении курса?',
        answer: 'Остановиться и лечь спать! Потому что хотелось ещё и ещё сделать, там чуть исправить, почитать теорию, как тут поспишь?',
      },
      {
        question: 'Какие советы можешь дать будущим студентам?',
        answer: 'Не жалей себя и не говори себе, что ты тупой) А вообще, в буткемпе надо осознавать, что ты пришёл учиться ради светлого будущего, и на 3 месяца погрузиться в абсолютно новый мир.',
      },
    ],
  },
]
