export const trainingWeb = [
  {
    id: 1,
    title: 'Git',
    items: [
      'Terminal',
      'Поймёшь, как работать в команде',
      'Будешь писать понятные комментарии к своему коду',
    ],
    marker: true,
  },
  {
    id: 2,
    title: 'CSS',
    items: [
      'Типографика',
      'Responsive and adaptive design',
      'Сетка',
      'Flexbox',
      'Grid',
      'БЭМ',
    ],
    marker: true,
  },
  {
    id: 3,
    title: 'HTML',
    items: [
      'Ссылки, кнопки, таблицы, формы',
      'Локальный сервер',
      'Семантическая вёрстка',
    ],
    marker: true,
  },
  {
    id: 4,
    title: 'DevTools',
    marker: true,
  },
]

export const trainingJS = [
  {
    id: 1,
    items: [
      'Переменные, типы данных, операторы',
      'Ветвления, циклы',
      'Функции, массивы, объекты',
      '--> Научился писать простые программы',
    ],
    marker: false,
  },
  {
    id: 2,
    items: [
      'Погружение в типы данных и их методы',
      'Модули, деление программы на части',
      'Работа с документом',
      'События и обработка ошибок',
      '--> Умеешь создавать простые сервисы',
    ],
    marker: false,
  },
  {
    id: 3,
    items: ['Асинхронное взаимодействие с сервером (API)', 'Хранение данных'],
    marker: false,
  },
]

export const trainingReact = [
  {
    id: 1,
    items: [
      'Компоненты и их жизненный цикл',
      'Состояние',
    ],
    marker: true,
  },
  {
    id: 2,
    items: [
      'События',
      'Render',
    ],
    marker: true,
  },
  {
    id: 3,
    items: [
      'Hook',
    ],
    marker: true,
  },
]

export const trainingJob = [
  {
    id: 1,
    items: [
      'Напишешь резюме и сопроводительное письмо (в американском стиле)',
      'Поймёшь, как искать адекватные компании',
      'Потренируешься проходить технические собеседования',
    ],
  },
]
