export const dailyCard = [
  {
    id: 1,
    time: '09:00',
    text: 'С наставником. Новая теория, совместное решение задач, проверка домашней работы',
  },
  {
    id: 2,
    time: '12:00',
    text: 'Обед и самостоятельное решение задач',
  },
  {
    id: 3,
    time: '',
    text: '',
  },
  {
    id: 4,
    time: '14:00',
    text: 'С наставником. Закрепление материала, разбор сложных моментов',
  },
  {
    id: 5,
    time: '17:00',
    text: 'Сам или в паре с другим студентом',
  },
  {
    id: 6,
    time: '',
    text: '',
  },
  {
    id: 7,
    time: '19:00',
    text: 'Свободное время',
  },
  {
    id: 8,
    time: '',
    text: '',
  },
]
